app/Controllers/ComponentController.php

SELECT *
FROM `tbl_component_master`
SELECT *
FROM `tbl_component_master`
ORDER BY `tbl_component_master`.`component_master_id` DESC
 LIMIT 10
---
            }
        }
        //echo $order."-".$orderBy."-".$rowperpage."-".$start; die;
        $componentMasterModelTotalData = $componentMasterModel->findAll();
        $componentMasterModelData      = $componentMasterModel->orderBy($order, $orderBy)
                                                ->findAll($rowperpage, $start);