app/Controllers/LoginController.php

SELECT COUNT(*) AS `numrows` FROM `tbl_admin_master`
---
    public function index()
    {
        $admin_master_model = new AdminMasterModel();
        $admin_data = $admin_master_model->countAll();