app/Controllers/ProductController.php

SELECT `tbl_product_master`.*, `tbl_category_master`.`category_master_name`
FROM `tbl_product_master`
JOIN `tbl_category_master` ON `tbl_category_master`.`category_master_id`=`tbl_product_master`.`product_category_id`
WHERE `tbl_product_master`.`product_status` = '1'
---
    public function index()
    {
        $session = session();
        $productMasterModel         = new ProductMasterModel();

        $productMaster_data = $productMasterModel->select("tbl_product_master.*, tbl_category_master.category_master_name")
                                                ->join("tbl_category_master", "tbl_category_master.category_master_id=tbl_product_master.product_category_id")
                                                ->where("tbl_product_master.product_status", "1")
                                                ->findAll();

SELECT *
FROM `tbl_product_master`
SELECT `tbl_product_master`.*, `tbl_category_master`.`category_master_name`
FROM `tbl_product_master`
JOIN `tbl_category_master` ON `tbl_category_master`.`category_master_id`=`tbl_product_master`.`product_category_id`
ORDER BY `tbl_product_master`.`product_id` DESC
 LIMIT 10
---
            }
        }
        //echo $order."-".$orderBy."-".$rowperpage."-".$start; die;
        $productMasterModelTotalData = $productMasterModel->findAll();
        $productMasterModelData      = $productMasterModel->select("tbl_product_master.*, tbl_category_master.category_master_name")
                                                            ->join("tbl_category_master", "tbl_category_master.category_master_id=tbl_product_master.product_category_id")
                                                            ->orderBy($order, $orderBy)
                                                            ->findAll($rowperpage, $start);

SELECT *
FROM `tbl_category_master`
WHERE `category_master_status` = '1'
SELECT *
FROM `tbl_component_master`
WHERE `component_master_status` = '1'
SELECT *
FROM `tbl_product_master`
WHERE `product_id` = '3'
 LIMIT 1
SELECT *
FROM `tbl_product_specification`
WHERE `product_master_id` = '3'
AND `product_specification_status` = '1'
---
    public function edit_product($id = 0)
    {
        $session = session();
        $categoryMasterModel        = new CategoryMasterModel();
        $componentMasterModel       = new ComponentMasterModel();
        $productMasterModel         = new ProductMasterModel();
        $productBOMModel            = new ProductBOMModel();
        $productSpecificationModel  = new ProductSpecificationModel();

        $categoryMasterModelData        = $categoryMasterModel->where("category_master_status", "1")->findAll();
        $componentMasterModelData       = $componentMasterModel->where("component_master_status", "1")->findAll();
        $productData                    = $productMasterModel->where("product_id", $id)->first();
        $productBOMModelData            = $productBOMModel->where("product_bom_product_id", $id)->where("product_bom_status", "1")->findAll();
        $productSpecificationModelData  = $productSpecificationModel->where("product_master_id", $id)->where("product_specification_status", "1")->findAll();

SELECT *
FROM `tbl_product_documents`
WHERE `product_documents_status` = '1'
AND `product_documents_type` = 'design'
AND `product_documents_product_id` = '3'
SELECT *
FROM `tbl_product_documents`
WHERE `product_documents_status` = '1'
AND `product_documents_type` = 'r&d'
AND `product_documents_product_id` = '3'
SELECT *
FROM `tbl_product_documents`
WHERE `product_documents_status` = '1'
AND `product_documents_type` = 'customer'
AND `product_documents_product_id` = '3'
---
    public function download_documents($id = 0)
    {
        $session = session();
        $productDocumentsModel = new ProductDocumentsModel();

        $design_data = $productDocumentsModel->where("product_documents_status", "1")
                                                ->where("product_documents_type", "design")
                                                ->where("product_documents_product_id", $id)
                                                ->findAll();

        $randd_data = $productDocumentsModel->where("product_documents_status", "1")
                                                ->where("product_documents_type", "r&d")
                                                ->where("product_documents_product_id", $id)
                                                ->findAll();

        $customer_data = $productDocumentsModel->where("product_documents_status", "1")
                                                ->where("product_documents_type", "customer")
                                                ->where("product_documents_product_id", $id)
                                                ->findAll();